Билет10/CalculationRegisters/НачисленияСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>НачисленияСотрудникам</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботы.Resource.Часов</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочихДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Билет10/CommonModules/Расчет/Ext/Module.bsl
Процедура РассчитатьНачисления(Регистратор) Экспорт
	// Оплата по часам
	НаборЗаписей	= РегистрыРасчета.НачисленияСотрудникам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);	
	НаборЗаписей.Прочитать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияСотрудникамДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	НачисленияСотрудникамДанныеГрафика.ЧасовФактическийПериодДействия КАК ЧасовФакт,
		|	НачисленияСотрудникамДанныеГрафика.ДнейФактическийПериодДействия КАК ДнейФакт
		|ИЗ
		|	РегистрРасчета.НачисленияСотрудникам.ДанныеГрафика(
		|			Регистратор = &Регистратор
		|				И ПериодРегистрации = &ПериодРегистрации
		|				И ВидРасчета = &ВидРасчетаОплатаПоЧасам) КАК НачисленияСотрудникамДанныеГрафика
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ВидРасчетаОплатаПоЧасам", ПланыВидовРасчета.ОсновныеНачисления.ОкладПоЧасам);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Регистратор.Дата));
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка	= РезультатЗапроса.Выбрать();
		СтруктураПоиска	= Новый Структура("НомерСтроки",);
		Для каждого Запись Из НаборЗаписей Цикл
			СтруктураПоиска.НомерСтроки	= Запись.НомерСтроки;
			Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
				Если Запись.Сторно Тогда
					Запись.Результат	= -Запись.Параметр * Выборка.ЧасовФакт;			
					Запись.РабочихДней	= -Выборка.ДнейФакт;	
				Иначе					
					Запись.Результат	= Запись.Параметр * Выборка.ЧасовФакт;			
					Запись.РабочихДней	= Выборка.ДнейФакт;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать(, Истина);	
	КонецЕсли;
	
	// Компенсация за обед
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияСотрудникамДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(НачисленияСотрудникамДанныеГрафика.ДнейФактическийПериодДействия, 0) КАК ДнейФакт,
		|	ЕСТЬNULL(НачисленияСотрудникамДанныеГрафика.ДнейПериодРегистрации, 0) КАК ДнейПлан,
		|	ЕСТЬNULL(НачисленияСотрудникамБазаНачисленияСотрудникам.РезультатБаза, 0) КАК База
		|ИЗ
		|	РегистрРасчета.НачисленияСотрудникам.ДанныеГрафика(
		|			Регистратор = &Регистратор
//		|				И ПериодРегистрации = &ПериодРегистрации
		|				И ВидРасчета = &ВидРасчетаКомпенсация) КАК НачисленияСотрудникамДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.НачисленияСотрудникам.БазаНачисленияСотрудникам(
		|				&ИзмеренияРегистра,
		|				&ИзмеренияРегистра,
		|				,
		|				Регистратор = &Регистратор
//		|					И ПериодРегистрации = &ПериодРегистрации
		|					И ВидРасчета = &ВидРасчетаКомпенсация) КАК НачисленияСотрудникамБазаНачисленияСотрудникам
		|		ПО НачисленияСотрудникамДанныеГрафика.НомерСтроки = НачисленияСотрудникамБазаНачисленияСотрудникам.НомерСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	ИзмеренияРегистра		= Новый Массив(2);
	ИзмеренияРегистра[0]	= "Сотрудник";
	ИзмеренияРегистра[1]	= "Подразделение";
	
	Запрос.УстановитьПараметр("ИзмеренияРегистра", ИзмеренияРегистра);
	Запрос.УстановитьПараметр("ВидРасчетаКомпенсация", ПланыВидовРасчета.ОсновныеНачисления.КомпенсацияЗаОбед);
//	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Регистратор.Дата));
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка	= РезультатЗапроса.Выбрать();
		СтруктураПоиска	= Новый Структура("НомерСтроки",);
		Для каждого Запись Из НаборЗаписей Цикл
			СтруктураПоиска.НомерСтроки	= Запись.НомерСтроки;
			Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда         
				//Если Запись.Сторно Тогда
				//	Запись.Результат	= -?(Выборка.ДнейПлан=0, 0, Выборка.ДнейФакт * 0.05 * Выборка.База / Выборка.ДнейПлан);		
				//	Запись.ДнейКомпенсации	= -Выборка.ДнейФакт; 
				//Иначе
				//	Запись.Результат	= ?(Выборка.ДнейПлан=0, 0, Выборка.ДнейФакт * 0.05 * Выборка.База / Выборка.ДнейПлан);		
				//	Запись.ДнейКомпенсации	= Выборка.ДнейФакт; 
				//КонецЕсли;
				
				// проблема с периодом регистратрации - не будем сторнировать компенсацию и убрали у КомпенсацияЗаОбед вытеснение Невыходо
				Запись.Результат	= ?(Выборка.ДнейПлан=0, 0, Выборка.ДнейФакт * 0.05 * Выборка.База / Выборка.ДнейПлан);		
				Запись.ДнейКомпенсации	= Выборка.ДнейФакт; 
			КонецЕсли;              
		КонецЦикла;
		НаборЗаписей.Записать(, Истина);	
	КонецЕсли;

КонецПроцедуры
